# Pandas DataFrame olu≈üturma

In [5]:
import numpy as np
import pandas as pd

In [10]:
lis = [3, 6, 1, 8]

In [11]:
df = pd.DataFrame(lis, columns=['column1'])

In [12]:
df

   column1
0        3
1        6
2        1
3        8

In [14]:
m = np.arange(1, 10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [23]:
df = pd.DataFrame(m, columns = ['Column1', 'Column2', 'Column3'])

In [26]:
df

   Column1  Column2  Column3
0        1        2        3
1        4        5        6
2        7        8        9

In [27]:
df.head(2)

   Column1  Column2  Column3
0        1        2        3
1        4        5        6

In [28]:
df.columns

Index(['Column1', 'Column2', 'Column3'], dtype='object')

In [29]:
df.columns = ('c1', 'c2', 'c3')

In [30]:
df

   c1  c2  c3
0   1   2   3
1   4   5   6
2   7   8   9

In [32]:
type(df)

pandas.core.frame.DataFrame

In [33]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['c1', 'c2', 'c3'], dtype='object')]

In [34]:
df.shape

(3, 3)

In [35]:
df.size

9

In [36]:
df.ndim

2

In [37]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [43]:
df.head()

   c1  c2  c3
0   1   2   3
1   4   5   6
2   7   8   9

In [46]:
df.tail(2)

   c1  c2  c3
1   4   5   6
2   7   8   9

In [47]:
data = np.array([1,2,3])

In [48]:
df = pd.DataFrame(data, columns=['column1'])

In [49]:
df

   column1
0        1
1        2
2        3